-- USE test;
DROP TABLE IF EXISTS `tbl_sc`;
CREATE TABLE `tbl_sc` (
    `name`    VARCHAR(10),
    `course`  VARCHAR(10),
    `score`   FLOAT
) CHARSET=utf8mb4;
INSERT INTO `tbl_sc` (`name`,`course`,`score`) VALUES
    ('张三','政治',72.5),
    ('张三','历史',66.0),
    ('张三','地理',86.1),
    ('张三','语文',44.9),
    ('张三','数学',45.3),
    ('张三','外语',40.2),
    ('张三','物理',65.7),
    ('张三','化学',70.5),
    ('张三','生物',98.0);
INSERT INTO `tbl_sc` (`name`,`course`,`score`) VALUES
    ('李四','政治',71.5),
    ('李四','历史',81.6),
    ('李四','地理',80.3),
    ('李四','语文',73.0),
    ('李四','数学',68.8),
    ('李四','外语',58.8),
    ('李四','物理',67.7),
    ('李四','化学',62.2),
    ('李四','生物',35.8);
INSERT INTO `tbl_sc` (`name`,`course`,`score`) VALUES
    ('王五','政治',46.9),
    ('王五','历史',62.6),
    ('王五','地理',77.6),
    ('王五','语文',70.4),
    ('王五','数学',55.2),
    ('王五','外语',81.2),
    ('王五','物理',58.9),
    ('王五','化学',85.3),
    ('王五','生物',59.0);
INSERT INTO `tbl_sc` (`name`,`course`,`score`) VALUES
    ('赵六','政治',79.1),
    ('赵六','历史',58.6),
    ('赵六','地理',43.2),
    ('赵六','语文',74.2),
    ('赵六','数学',82.2),
    ('赵六','外语',59.5),
    ('赵六','物理',66.4),
    ('赵六','化学',99.0),
    ('赵六','生物',73.6);
